Repository: wesleybliss/cnvrt
Catalog: lib/l10n/app_*.arb
Languages: es

source: Hello World!
es: ¡Hola Mundo!

source: Theme
es: Tema

source: Language
es: Idioma

source: System
es: Sistema

source: Settings
es: Ajustes

source: Currencies
es: Monedas

source: Units
es: Unidades

# chooseYourFavoriteCurrencies
source: Choose your favorite currencies.\nThese will be pinned to the home screen.
es: Elige tus monedas favoritas.\nEstas se mostrarán en la pantalla de inicio.

# searchByNameOrSymbol
source: Search by name or symbol (e.g. USD)
es: Busca por nombre o símbolo (p. ej. USD)

# noSelectedCurrencies
source: You don't have any currencies selected yet. Add some by clicking the button below.
es: Aún no has seleccionado ninguna moneda. Añade algunas haciendo clic en el botón de abajo.

source: Manage Currencies
es: Administrar Monedas

source: Select an option
es: Selecciona una opción

source: Round decimals to
es: Redondear decimales a

source: Update frequency
es: Frecuencia de actualización

source: Use large inputs
es: Usar entradas grandes

source: Show drag to reorder handles
es: Mostrar los controladores de arrastrar para reordenar

source: Show copy to clipboard buttons
es: Mostrar los botones de copiar al portapapeles

source: Show full currency name label
es: Mostrar la etiqueta del nombre completo de la moneda

source: Align inputs to
es: Alinear las entradas a

source: Show current rates
es: Mostrar las tasas actuales

source: Account for inflation
es: Tener en cuenta la inflación

source: Show country flags
es: Mostrar banderas de países

source: Allow decimal input
es: Permitir entrada decimal

source: All
es: Todo

source: Selected
es: Seleccionado

source: None
es: Ninguno

source: Temperature
es: Temperatura

source: Distance
es: Distancia

source: Speed
es: Velocidad

source: Weight
es: Peso

source: Area
es: Área

source: Volume
es: Volumen

# themeDescription
source: Choose the app's appearance: light, dark, or system default
es: Elige la apariencia de la aplicación: claro, oscuro o predeterminado del sistema

# languageDescription
source: Select the display language for the app
es: Selecciona el idioma de visualización de la aplicación

# roundDecimalsToDescription
source: Set how many decimal places to show in results
es: Establece cuántos decimales mostrar en los resultados

# updateFrequencyDescription
source: Choose how often exchange rates are refreshed
es: Elige con qué frecuencia se actualizan las tasas de cambio

# useLargeInputsDescription
source: Enable larger input fields for easier tapping
es: Activa campos de entrada más grandes para facilitar el uso

# showDragToReorderHandlesDescription
source: Show drag handles to reorder currency inputs
es: Muestra controles para arrastrar y reordenar entradas de moneda

# showCopyToClipboardButtonsDescription
source: Display buttons to copy conversion results
es: Muestra botones para copiar los resultados de conversión

# showFullCurrencyNameLabelDescription
source: Show full currency names alongside symbols
es: Muestra el nombre completo de la moneda junto al símbolo

# alignInputsToDescription
source: Choose text alignment for input fields
es: Elige la alineación de texto para los campos de entrada

# showCurrentRatesDescription
source: Display the current exchange rate beneath conversions
es: Muestra la tasa de cambio actual debajo de las conversiones

# accountForInflationDescription
source: Adjust conversion results for inflation over time
es: Ajusta los resultados de conversión por inflación a lo largo del tiempo

# showCountryFlagsDescription
source: Show country flags next to currency symbols
es: Muestra banderas de países junto a los símbolos de moneda

# allowDecimalInputDescription
source: Allow entering decimal points in input fields
es: Permite ingresar puntos decimales en los campos de entrada

# inflationHelpTitle
source: Account for Inflation
es: Tener en cuenta la inflación

# inflationHelpContent
source: Enable accounting for inflation to make entering currencies with large inflated rates automatically multiply by 1,000 for easier input. For example, if 5,000.00 COP = $1 USD, you can just enter 5 COP and it will treat it as 5,000.00 for convenience.
es: Cuando está habilitada, esta función ajusta los resultados de conversión de moneda para tener en cuenta la inflación a lo largo del tiempo. La inflación es la tasa a la que el nivel general de precios de bienes y servicios aumenta, lo que hace que el poder adquisitivo disminuya. Esto significa que el dinero hoy vale más que la misma cantidad de dinero en el futuro. Por ejemplo: Si estás comparando valores de moneda de diferentes períodos de tiempo, habilitar esta opción ajustará la conversión para reflejar la diferencia real del poder adquisitivo, no solo el tipo de cambio nominal. Esto es particularmente útil al analizar tasas de cambio históricas o hacer comparaciones financieras entre diferentes períodos de tiempo. Nota: Los cálculos de inflación utilizan datos históricos y pueden variar según el país y el período de tiempo.
